import { Component, computed, OnInit, signal } from '@angular/core';
import { Place } from '../../types/place';
import { PlaceCard } from '../place-card/place-card';
import { ModalPlaceCard } from '../modal-place-card/modal-place-card';

@Component({
  imports: [PlaceCard, ModalPlaceCard],
  selector: 'app-main',
  styleUrl: './main.scss',
  templateUrl: './main.html',
})
export class Main implements OnInit {

  received_places: Place[] = [
    {
      id: '1',
      name: 'Aegean Hideaway',
      category: 'Отель',
      city: 'Имеровигли',
      country: 'Греция',
      rating: 5.0,
      priceLevel: 3,
      tags: ['Скала', 'Панорамный вид', 'Тихое место', 'Природные бассейны'],
      badge: 'Эксклюзив',
      shortDescription:
        'Отель, высеченный прямо в скале над морем, где из каждого номера открывается панорамный вид на бескрайний горизонт. Пространство словно становится частью природного ландшафта, а мягкий свет и натуральные материалы ',
      description:
        'Отель, высеченный прямо в скале над морем, где из каждого номера открывается панорамный вид на бескрайний горизонт. Пространство словно становится частью природного ландшафта, а мягкий свет и натуральные материалы создают ощущение тепла и уединения. Здесь легко замедлиться: просыпаться под шум волн, наблюдать, как солнце меняет оттенки моря, и провожать день, никуда не спеша.\n\nПлавные линии интерьера повторяют очертания скалы, а светлые ткани и фактура камня подчеркивают красоту простых деталей. Утро располагает к неспешному кофе с видом на море, день — к отдыху в прохладе номера, а вечер — к долгим разговорам на закате. Место для тех, кто хочет побыть вдвоем или наедине с собой, отвлечься от повседневных забот и почувствовать спокойный ритм островной жизни.',
      imageUrl: '/images/places/aegean-hideaway.png',
      latitude: 36.431,
      longitude: 25.422,
      isPublished: true,
    },

    {
      id: '2',
      name: 'Aqua Vista',
      category: 'Ресторан',
      city: 'Мале',
      country: 'Мальдивы',
      rating: 4.9,
      priceLevel: 2,
      tags: ['Под водой', 'Вид на рыб'],
      badge: null,
      shortDescription:
        'Ресторан на глубине 5 метров под водой с панорамным видом на бескрайний океан и его обитателей. Огромные стеклянные стены создают ощущение полного погружения: вокруг проплывают тропические рыбы, а солнечные лучи проникают сквозь толщу воды, рисуя подвижные узоры на столах и полу.',
      description:
        'Ресторан на глубине 5 метров под водой с панорамным видом на бескрайний океан и его обитателей. Огромные стеклянные стены создают ощущение полного погружения:вокруг проплывают тропические рыбы, а солнечные лучи проникают сквозь толщу воды, рисуя подвижные узоры на столах и полу. В меню — свежие морепродукты, авторские блюда с тропическими акцентами и лёгкие десерты. Мягкий свет и лаконичный интерьер позволяют сосредоточиться на главном: вкусе, разговоре и океане за стеклом. Здесь хочется задержаться, чтобы попробовать ещё одно блюдо и проводить взглядом ската, плавно скользящего над головой. К вечеру пространство наполняется глубокими синими оттенками. За панорамными окнами постепенно темнеет, и ужин становится особенно камерным — будь то романтическое свидание, встреча с близкими или вечер наедине с океаном.',
      imageUrl: '/images/places/aqua-vista.png',
      latitude: 4.1755,
      longitude: 73.5093,
      isPublished: true,
    },

    {
      id: '3',
      name: 'Mist Springs',
      category: 'СПА и релакс',
      city: 'Хаконе',
      country: 'Япония',
      rating: 4.7,
      priceLevel: 2,
      tags: ['Лес', 'Горячие источники', 'Туман', 'Природные бассейны'],
      badge: '18+',
      shortDescription:
        'Уединённый термальный комплекс среди горного леса, где природные бассейны растворяются в утреннем тумане. Природные горячие источники.',
      description:
        'Уединённый термальный комплекс среди горного леса, где природные бассейны растворяются в утреннем тумане. Природные горячие источники каскадом спускаются по склону, окружённому густой зеленью и скалами. Здесь можно провести несколько часов в тёплой воде, наслаждаясь тишиной, прохладным горным воздухом и шумом небольших водопадов.Пространство дополнено уютными зонами отдыха, органично вписанными в окружающий пейзаж.',
      imageUrl: '/images/places/mist-springs.png',
      latitude: 35.2324,
      longitude: 139.1069,
      isPublished: true,
    },

    {
      id: '4',
      name: 'Skyline Cinema',
      category: 'Развлечения',
      city: 'Дубай',
      country: 'ОАЭ',
      rating: 4.4,
      priceLevel: 1,
      tags: ['На крыше', 'Вид на город'],
      badge: null,
      shortDescription:
        'Кинотеатр на крыше небоскрёба, где фильмы смотрят под открытым небом на фоне сияющей панорамы ночного города.',
      description:
        'Кинотеатр на крыше небоскрёба, где фильмы смотрят под открытым небом на фоне сияющей панорамы ночного города.\n\nВместо привычных кресел здесь расположены широкие диваны с подушками и небольшими столиками. Между рядами горят фонари, а стеклянное ограждение позволяет любоваться городом с любого места. Звук передаётся в беспроводные наушники, чтобы ничто не отвлекало от фильма.\n\nВ программе — любимая классика, романтические комедии и тематические киновечера. До начала сеанса можно заказать прохладительные напитки и попкорн, устроиться поудобнее и застать последние краски заката.',
      imageUrl: '/images/places/skyline-cinema.png',
      latitude: 25.2048,
      longitude: 55.2708,
      isPublished: true,
    },

    {
      id: '5',
      name: 'Echoes of Stone',
      category: 'Культура',
      city: 'Матера',
      country: 'Италия',
      rating: 4.9,
      priceLevel: 1,
      tags: ['Пещеры', 'Иммерсивное искусство'],
      badge: 'Только по записи',
      shortDescription:
        'Галерея внутри древних пещер, где произведения искусства оживают с помощью света, звука и проекций прямо на каменных стенах.',
      description:
        'Галерея внутри древних пещер, где произведения искусства оживают с помощью света, звука и проекций прямо на каменных стенах.\n\nМаршрут проходит через несколько соединённых залов, каждый из которых посвящён отдельной эпохе. Архивные изображения, старинные фрески и современные иллюстрации медленно появляются на неровных сводах, подчёркивая естественную фактуру камня.\n\nЗвуковое сопровождение меняется при переходе из одной пещеры в другую: от шёпота и колокольного звона до музыки современных композиторов. Посещения проводят небольшими группами, чтобы сохранить камерную атмосферу и не нарушать акустику пространства.',
      imageUrl: '/images/places/echoes-of-stone.png',
      latitude: 40.6663,
      longitude: 16.6043,
      isPublished: true,
    },

    {
      id: '6',
      name: 'Aurora Glass Lodge',
      category: 'Отель',
      city: 'Рованиеми',
      country: 'Финляндия',
      rating: 4.8,
      priceLevel: 2,
      tags: ['Стеклянная крыша', 'Северное сияние'],
      badge: null,
      shortDescription:
        'Стеклянные домики посреди заснеженного леса, где северное сияние можно наблюдать прямо из кровати. Панорамные стены и прозрачная крыша открывают вид на звёздное небо и бескрайние снежные пейзажи, сохраняя внутри тепло и уют.',
      description:
        'Стеклянные домики посреди заснеженного леса, где северное сияние можно наблюдать прямо из кровати. Панорамные стены и прозрачная крыша открывают вид на звёздное небо и бескрайние снежные пейзажи, сохраняя внутри тепло и уют.\n\nДнём здесь можно гулять среди заснеженных деревьев, вдыхать морозный воздух и слушать, как хрустит снег под ногами. А после — согреваться горячим чаем, укрывшись пледом, и наблюдать, как за стеклом медленно сгущаются сумерки.\n\nВечером в домике приглушают свет, и всё внимание достаётся небу. В ясную ночь над лесом проступают тысячи звёзд, а если повезёт — появляются переливы северного сияния. Место для неспешного отдыха вдвоём или тихих дней наедине с собой, когда можно отложить телефон и просто любоваться тем, что происходит вокруг.',
      imageUrl: '/images/places/aurora-glass-lodge.png',
      latitude: 66.5039,
      longitude: 25.7294,
      isPublished: true,
    },
  ];

  filters = [
    { id: 1, name: 'Все' },
    { id: 2, name: 'Отели' },
    { id: 3, name: 'Рестораны' },
    { id: 4, name: 'Развлечения' },
    { id: 5, name: 'Природа' },
    { id: 6, name: 'Культура' },
    { id: 7, name: 'Архитектура' },
    { id: 8, name: 'СПА и релакс' },
  ];



  show_full_place_card = signal(false);
  applied_filter = signal('Все');
  places  = computed(() =>{
    let filter = this.applied_filter();

    if (filter === 'Все') {
      return this.received_places;
    }
    if (filter === "Отели") {
      filter = "Отель"
    } else if (filter === "Рестораны") {
      filter = "Ресторан"
    }
    return this.received_places.filter(place => place.category === filter);
  });


  detailed_place = signal<Place>(this.places()[0]);


  ngOnInit(): void {
    //console.log(this.places());

  }

  showFullPlaceDetails(place: Place) {
    this.show_full_place_card.set(true);
    this.detailed_place.set(place);
  }

  hideFullPlaceDetails(isToHide: boolean) {
    if (isToHide) {
      this.show_full_place_card.set(false);
    }
  }

  setFilter(filter: string) {
    this.applied_filter.set(filter);
  }
}
